const dummyWiki = [
  {
    id: 1,
    title: "파이썬 입문",
    content:
      "파이썬은 배우기 쉽고 다양한 응용 프로그램을 지원하는 인기있는 프로그래밍 언어입니다.",
  },
  {
    id: 2,
    title: "변수와 데이터 타입",
    content:
      "파이썬에서는 변수에 정수, 실수, 문자열, 불린과 같은 다양한 데이터 타입을 할당할 수 있습니다.",
  },
  {
    id: 3,
    title: "제어 구조",
    content:
      "파이썬은 if-else문, while 루프, for 루프와 같은 제어 구조를 제공하여 개발자가 더 복잡한 프로그램을 작성할 수 있도록 지원합니다.",
  },
  {
    id: 4,
    title: "함수와 모듈",
    content:
      "파이썬에서 함수는 반복적으로 호출할 수 있는 코드 블록이며, 모듈은 관련된 함수의 집합으로 다른 프로그램에서 가져와 사용할 수 있습니다.",
  },
  {
    id: 5,
    title: "파일 입출력",
    content:
      "파이썬은 파일 입출력 작업을 지원하여 프로그램이 파일에서 데이터를 읽고 쓸 수 있도록 합니다.",
  },
  {
    id: 6,
    title: "객체 지향 프로그래밍",
    content:
      "객체 지향 프로그래밍(OOP)은 파이썬에서 지원하는 프로그래밍 패러다임입니다. OOP에서 프로그램은 데이터와 메서드를 포함하는 객체를 기반으로 구성됩니다.",
  },
  {
    id: 7,
    title: "데이터 구조",
    content:
      "파이썬은 리스트, 튜플, 딕셔너리와 같은 내장 데이터 구조를 제공하여 개발자가 데이터를 효율적으로 저장하고 조작할 수 있도록 지원합니다.",
  },
  {
    id: 8,
    title: "정규 표현식",
    content:
      "정규 표현식은 파이썬에서 텍스트 검색 및 조작에 사용되는 강력한 도구입니다. 개발자는 텍스트에서 패턴을 검색하고 복잡한 텍스트 처리 작업을 수행할 수 있습니다.",
  },
  {
    id: 9,
    title: "디버깅과 테스트",
    content:
      "디버깅과 테스트는 파이썬 개발 과정에서 중요한 부분입니다. 파이썬은 pdb 디버거와 unittest 모듈과 같은 도구를 제공하여 개발자가 코드에서 버그를 식별하고 수정할 수 있도록 지원합니다.",
  },
  {
    id: 10,
    title: "파이썬을 이용한 웹 개발",
    content:
      "파이썬은 웹 개발 분야에서 매우 인기 있는 언어입니다. Django와 Flask와 같은 다양한 웹 프레임워크를 사용하여 요청 및 응답 처리, 데이터베이스 상호작용 및 템플릿 렌더링과 같은 작업을 수행할 수 있습니다.",
  },
  {
    id: 11,
    title: "데이터베이스 연동",
    content:
      "파이썬은 다양한 데이터베이스 시스템과 연동이 가능합니다. SQLite, MySQL, PostgreSQL 등 다양한 데이터베이스 시스템과 연동하여 데이터를 관리할 수 있습니다.",
  },
  {
    id: 12,
    title: "자연어 처리",
    content:
      "파이썬은 자연어 처리 분야에서 강력한 지원을 제공합니다. NLTK(Natural Language Toolkit) 라이브러리와 같은 도구를 사용하여 텍스트 분석 및 처리 작업을 수행할 수 있습니다.",
  },
  {
    id: 13,
    title: "머신 러닝",
    content:
      "파이썬은 인기 있는 머신 러닝 라이브러리인 scikit-learn, TensorFlow, Keras 등을 지원합니다. 이를 사용하여 머신 러닝 모델을 개발하고 데이터를 분석할 수 있습니다.",
  },
  {
    id: 14,
    title: "데이터 시각화",
    content:
      "파이썬은 데이터 시각화 작업을 지원하여 개발자가 데이터를 쉽게 이해할 수 있도록 합니다. Matplotlib, Seaborn, Plotly와 같은 라이브러리를 사용하여 다양한 그래프와 차트를 생성할 수 있습니다.",
  },
  {
    id: 15,
    title: "보안과 암호화",
    content:
      "파이썬은 보안 및 암호화 분야에서 사용됩니다. PyCrypto와 같은 라이브러리를 사용하여 암호화된 통신 및 데이터 저장을 구현할 수 있습니다.",
  },
];

export default dummyWiki;
